app/controllers/songs_controller.rb

  def index
    artist_id = params[:artist_id]

    if artist_id
      artist = Artist.find_by(id: artist_id)

      if artist
        @songs = artist.songs
      else
        flash[:alert] = "Artist not found."
        redirect_to artists_path
      end

    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]

  def show
    artist_id = params[:artist_id]

    @song = Song.find_by(id: params[:id])
    if !@song
      flash[:alert] = "Song not found."
        artist_id = params[:artist_id]
        artist = Artist.find_by(id: artist_id)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]